adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
#include <periph/gpio.h>
#include <stm32l4xx_ll_bus.h>
#include <stm32l4xx_ll_adc.h>
#include <stm32l4xx_ll_dac.h>
#include <stm32l4xx_ll_gpio.h>
#include <stm32l4xx_ll_exti.h>
#include <stm32l4xx_ll_tim.h>
#include <stm32l4xx_ll_system.h>
#include <kernel.h>
#include <semaphore.h>
#include <assert.h>



TITAN_PDEBUG_FILE_MARK;

typedef struct __titan_gpio {
    //stm32l4 architecture
    GPIO_TypeDef *gpio;
    uint32_t pin;

    uint8_t adc;
    uint8_t dac;
    uint8_t pwm;
    
    uint32_t af0;
    uint32_t af1;
    uint32_t af2;
    uint32_t af3;
    uint32_t af4;
    uint32_t af5;
    uint32_t af6;
    uint32_t af7;
    uint32_t af8;
    uint32_t af9;
    uint32_t af10;
    uint32_t af12;
    uint32_t af13;
    uint32_t af14;
} titan_gpio_t;


/* alternate functions */
#define AF_TIM1         (1 << 0)
#define AF_TIM2         (1 << 1)
#define AF_TIM3         (1 << 2)
#define AF_TIM15        (1 << 3)
#define AF_TIM16        (1 << 4)
#define AF_LPTIM1       (1 << 5)
#define AF_LPTIM2       (1 << 6)
#define AF_I2C1         (1 << 7)
#define AF_I2C2         (1 << 8)
#define AF_I2C3         (1 << 9)
#define AF_I2C4         (1 << 10)
#define AF_SPI1         (1 << 11)
#define AF_SPI2         (1 << 12)
#define AF_SPI3         (1 << 13)
#define AF_UART1        (1 << 14)
#define AF_UART2        (1 << 15)
#define AF_UART3        (1 << 16)
#define AF_UART4        (1 << 17)
#define AF_LPUART1      (1 << 18)
#define AF_USB          (1 << 19)
#define AF_QUADSPI      (1 << 20)
#define AF_CAN1         (1 << 21)
#define AF_SDMMC1       (1 << 22)
#define AF_SAI1         (1 << 23)
#define AF_TSC          (1 << 24)
#define AF_DFSDM        (1 << 25)
#define AF_COMP1        (1 << 26)
#define AF_COMP2        (1 << 27)
#define AF_SYSAF        (1 << 28)




static const titan_gpio_t titan_pin_defs[TITAN_GPIO_TOTAL_PINS] = {
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_0,  .adc = 0x15, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM2,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = AF_UART2,      .af8 = AF_UART4,      .af9 = 0,             .af10 = 0,             .af12 = AF_COMP1,      .af13 = AF_SAI1,       .af14 = AF_TIM2        },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_1,  .adc = 0x16, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM2,        .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = AF_SPI1,       .af6 = 0,             .af7 = AF_UART2,      .af8 = AF_UART4,      .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = AF_TIM15       },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_2,  .adc = 0x17, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM2,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = AF_UART2,      .af8 = AF_LPUART1,    .af9 = 0,             .af10 = AF_QUADSPI,    .af12 = AF_COMP2,      .af13 = 0,             .af14 = AF_TIM15       },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_3,  .adc = 0x18, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM2,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = AF_UART2,      .af8 = AF_LPUART1,    .af9 = 0,             .af10 = AF_QUADSPI,    .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_TIM15       },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_4,  .adc = 0x19, .dac = 0x11, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = AF_SPI1,       .af6 = AF_SPI3,       .af7 = AF_UART2,      .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_LPTIM2      },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_5,  .adc = 0x1A, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM2,        .af2 = AF_TIM2,       .af3 = 0,             .af4 = 0,             .af5 = AF_SPI1,       .af6 = AF_DFSDM,      .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = AF_LPTIM2      },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_6,  .adc = 0x1B, .dac = 0x00, .pwm = 0x31, .af0 = 0,              .af1 = AF_TIM1,        .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = AF_SPI1,       .af6 = AF_COMP1,      .af7 = AF_UART3,      .af8 = AF_LPUART1,    .af9 = 0,             .af10 = AF_QUADSPI,    .af12 = AF_TIM1,       .af13 = 0,             .af14 = AF_TIM16       },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_7,  .adc = 0x1C, .dac = 0x00, .pwm = 0x32, .af0 = 0,              .af1 = AF_TIM1,        .af2 = AF_TIM3,       .af3 = 0,             .af4 = AF_I2C3,       .af5 = AF_SPI1,       .af6 = AF_DFSDM,      .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = AF_QUADSPI,    .af12 = AF_COMP2,      .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_8,  .adc = 0x00, .dac = 0x00, .pwm = 0x11, .af0 = AF_SYSAF,       .af1 = AF_TIM1,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = AF_DFSDM,      .af7 = AF_UART1,      .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_LPTIM2      },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_9,  .adc = 0x00, .dac = 0x00, .pwm = 0x12, .af0 = 0,              .af1 = AF_TIM1,        .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = 0,             .af6 = AF_DFSDM,      .af7 = AF_UART1,      .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_TIM15       },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_10, .adc = 0x00, .dac = 0x00, .pwm = 0x13, .af0 = 0,              .af1 = AF_TIM1,        .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = 0,             .af6 = 0,             .af7 = AF_UART1,      .af8 = 0,             .af9 = 0,             .af10 = AF_USB,        .af12 = 0,             .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_11, .adc = 0x00, .dac = 0x00, .pwm = 0x14, .af0 = 0,              .af1 = AF_TIM1,        .af2 = AF_TIM1,       .af3 = 0,             .af4 = 0,             .af5 = AF_SPI1,       .af6 = AF_COMP1,      .af7 = AF_UART1,      .af8 = 0,             .af9 = AF_CAN1,       .af10 = AF_USB,        .af12 = AF_TIM1,       .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_12, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM1,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = AF_SPI1,       .af6 = 0,             .af7 = AF_UART1,      .af8 = 0,             .af9 = AF_CAN1,       .af10 = AF_USB,        .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_13, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = 0      ,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = AF_USB,        .af12 = 0,             .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_14, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = AF_LPTIM1,      .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = AF_I2C4,       .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOA, .pin = LL_GPIO_PIN_15, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = AF_TIM2,        .af2 = AF_TIM2,       .af3 = AF_UART2,      .af4 = 0,             .af5 = AF_SPI1,       .af6 = AF_SPI3,       .af7 = AF_UART3,      .af8 = AF_UART4,      .af9 = AF_TSC,        .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },

    {.gpio = GPIOB, .pin = LL_GPIO_PIN_0,  .adc = 0x1F, .dac = 0x00, .pwm = 0x33, .af0 = 0,              .af1 = AF_TIM1,        .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = AF_SPI1,       .af6 = AF_DFSDM,      .af7 = AF_UART3,      .af8 = 0,             .af9 = 0,             .af10 = AF_QUADSPI,    .af12 = AF_COMP1,      .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_1,  .adc = 0x10, .dac = 0x00, .pwm = 0x34, .af0 = 0,              .af1 = AF_TIM1,        .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = AF_DFSDM,      .af7 = AF_UART3,      .af8 = AF_LPUART1,    .af9 = 0,             .af10 = AF_QUADSPI,    .af12 = 0,             .af13 = 0,             .af14 = AF_LPTIM2      },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_2,  .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = AF_LPTIM1,      .af2 = 0,             .af3 = 0,             .af4 = AF_I2C3,       .af5 = 0,             .af6 = AF_DFSDM,      .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_3,  .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = AF_TIM2,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = AF_SPI1,       .af6 = AF_SPI3,       .af7 = AF_UART1,      .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_4,  .adc = 0x00, .dac = 0x00, .pwm = 0x31, .af0 = AF_SYSAF,       .af1 = 0,              .af2 = AF_TIM3,       .af3 = 0,             .af4 = AF_I2C3,       .af5 = AF_SPI1,       .af6 = AF_SPI3,       .af7 = AF_UART1,      .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_5,  .adc = 0x00, .dac = 0x00, .pwm = 0x32, .af0 = 0,              .af1 = AF_LPTIM1,      .af2 = AF_TIM3,       .af3 = AF_CAN1,       .af4 = AF_I2C1,       .af5 = AF_SPI1,       .af6 = AF_SPI3,       .af7 = AF_UART1,      .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_COMP2,      .af13 = AF_SAI1,       .af14 = AF_TIM16       },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_6,  .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_LPTIM1,      .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = AF_I2C4,       .af6 = 0,             .af7 = AF_UART1,      .af8 = AF_CAN1,       .af9 = AF_TSC,        .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_TIM16       },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_7,  .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_LPTIM1,      .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = AF_I2C4,       .af6 = 0,             .af7 = AF_UART1,      .af8 = AF_UART4,      .af9 = AF_TSC,        .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_8,  .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = AF_CAN1,       .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = AF_SAI1,       .af14 = AF_TIM16       },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_9,  .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = AF_I2C1,       .af5 = AF_SPI2,       .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = AF_CAN1,       .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_10, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM2,        .af2 = 0,             .af3 = AF_I2C4,       .af4 = AF_I2C2,       .af5 = AF_SPI2,       .af6 = 0,             .af7 = AF_UART3,      .af8 = AF_LPUART1,    .af9 = AF_TSC,        .af10 = AF_QUADSPI,    .af12 = AF_COMP1,      .af13 = AF_SAI1,       .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_11, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM2,        .af2 = 0,             .af3 = AF_I2C4,       .af4 = AF_I2C2,       .af5 = 0,             .af6 = 0,             .af7 = AF_UART3,      .af8 = AF_LPUART1,    .af9 = 0,             .af10 = AF_QUADSPI,    .af12 = AF_COMP2,      .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_12, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM1,        .af2 = 0,             .af3 = AF_TIM1,       .af4 = AF_I2C2,       .af5 = AF_SPI2,       .af6 = AF_DFSDM,      .af7 = AF_UART3,      .af8 = AF_LPUART1,    .af9 = AF_TSC,        .af10 = AF_CAN1,       .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_TIM15       },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_13, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM1,        .af2 = 0,             .af3 = 0,             .af4 = AF_I2C2,       .af5 = AF_SPI2,       .af6 = AF_DFSDM,      .af7 = AF_UART3,      .af8 = AF_LPUART1,    .af9 = AF_TSC,        .af10 = AF_CAN1,       .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_TIM15       },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_14, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_TIM1,        .af2 = 0,             .af3 = 0,             .af4 = AF_I2C2,       .af5 = AF_SPI2,       .af6 = AF_DFSDM,      .af7 = AF_UART3,      .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_TIM15       },
    {.gpio = GPIOB, .pin = LL_GPIO_PIN_15, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = AF_TIM1,        .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = AF_SPI2,       .af6 = AF_DFSDM,      .af7 = 0,             .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_TIM15       },

    {.gpio = GPIOC, .pin = LL_GPIO_PIN_0,  .adc = 0x11, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_LPTIM1,      .af2 = AF_I2C4,       .af3 = 0,             .af4 = AF_I2C3,       .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = AF_LPUART1,    .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = AF_LPTIM2      },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_1,  .adc = 0x12, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = AF_LPTIM1,      .af2 = AF_I2C4,       .af3 = 0,             .af4 = AF_I2C3,       .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = AF_LPUART1,    .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_2,  .adc = 0x13, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_LPTIM1,      .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = AF_SPI2,       .af6 = AF_DFSDM,      .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_3,  .adc = 0x14, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = AF_LPTIM1,      .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = AF_SPI2,       .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = AF_SAI1,       .af14 = AF_LPTIM2      },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_4,  .adc = 0x1D, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = AF_UART3,      .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_5,  .adc = 0x1E, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = AF_UART3,      .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_6,  .adc = 0x00, .dac = 0x00, .pwm = 0x31, .af0 = 0,              .af1 = 0,              .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = AF_DFSDM,      .af7 = 0,             .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_7,  .adc = 0x00, .dac = 0x00, .pwm = 0x32, .af0 = 0,              .af1 = 0,              .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = AF_DFSDM,      .af7 = 0,             .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_8,  .adc = 0x00, .dac = 0x00, .pwm = 0x33, .af0 = 0,              .af1 = 0,              .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_9,  .adc = 0x00, .dac = 0x00, .pwm = 0x34, .af0 = 0,              .af1 = 0,              .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = AF_TSC,        .af10 = AF_USB,        .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_10, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = AF_SPI2,       .af7 = AF_UART3,      .af8 = AF_UART4,      .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_11, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = AF_SPI2,       .af7 = AF_UART3,      .af8 = AF_UART4,      .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_12, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = AF_SPI2,       .af7 = AF_UART3,      .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_13, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_14, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },
    {.gpio = GPIOC, .pin = LL_GPIO_PIN_15, .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = 0,              .af1 = 0,              .af2 = 0,             .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = 0,             .af8 = 0,             .af9 = 0,             .af10 = 0,             .af12 = 0,             .af13 = 0,             .af14 = 0              },

    {.gpio = GPIOD, .pin = LL_GPIO_PIN_2 , .adc = 0x00, .dac = 0x00, .pwm = 0x00, .af0 = AF_SYSAF,       .af1 = 0,              .af2 = AF_TIM3,       .af3 = 0,             .af4 = 0,             .af5 = 0,             .af6 = 0,             .af7 = AF_UART3,      .af8 = 0,             .af9 = AF_TSC,        .af10 = 0,             .af12 = AF_SDMMC1,     .af13 = 0,             .af14 = 0              },
};


typedef struct __titan_gpio_setting {
    uint8_t mode;

    //exti settings
    uint32_t exti_line;
    IRQn_Type exti_irq;
    gpio_isr_t exti;
    gpio_isr_param_t exti_param;
    uint32_t param;
    uint8_t bits;
} titan_gpio_setting_t;

static titan_gpio_setting_t titan_pin_settings[TITAN_GPIO_TOTAL_PINS] = {0};

//to track active pins and enable/disable port clock
static uint32_t gpioa_active = 0;
static uint32_t gpiob_active = 0;
static uint32_t gpioc_active = 0;
static uint32_t gpiod_active = 0;

