adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
//to track active extis and info on them
static uint32_t exti_active = 0;
static uint32_t exti9_5_active = 0;
static uint32_t exti15_10_active = 0;
static uint32_t exti_pin[16] = {0};

//to track active PWMs
static uint32_t tim1_active = 0;
static uint32_t tim3_active = 0;

//to track active ADC channels
static uint32_t adc1_active = 0;
static uint32_t adc1_bits = 0;
static task_t *adc1_waiting_task = 0;
static uint32_t adc1_result = 0;
static semaphore_t adc1_semaphore;
static uint8_t adc1_semaphore_created = 0;

#define ADC_SAMPLING_TIME   LL_ADC_SAMPLINGTIME_47CYCLES_5

static void _gpio_init_gpio(gpio_pin_t pin) {
    switch((uint32_t)titan_pin_defs[pin].gpio) {
        case (uint32_t)GPIOA:
            if(gpioa_active == 0) {
                LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA);
            }
            gpioa_active |= titan_pin_defs[pin].pin;
            break;

        case (uint32_t)GPIOB:
            if(gpiob_active == 0) {
                LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB);
            }
            gpiob_active |= titan_pin_defs[pin].pin;
            break;

        case (uint32_t)GPIOC:
            if(gpioc_active == 0) {
                LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOC);
            }
            gpioc_active |= titan_pin_defs[pin].pin;
            break;

        case (uint32_t)GPIOD:
            if(gpiod_active == 0) {
                LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOD);
            }
            gpiod_active |= titan_pin_defs[pin].pin;
            break;
    }
}

static void _gpio_deinit_gpio(gpio_pin_t pin) {
    switch((uint32_t)titan_pin_defs[pin].gpio) {
        case (uint32_t)GPIOA:
            gpioa_active &= ~titan_pin_defs[pin].pin;
            if(gpioa_active == 0) {
                LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOA);
            }
            break;

        case (uint32_t)GPIOB:
            gpiob_active &= ~titan_pin_defs[pin].pin;
            if(gpiob_active == 0) {
                LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOB);
            }
            break;

        case (uint32_t)GPIOC:
            gpioc_active &= ~titan_pin_defs[pin].pin;
            if(gpioc_active == 0) {
                LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOC);
            }
            break;

        case (uint32_t)GPIOD:
            gpiod_active &= ~titan_pin_defs[pin].pin;
            if(gpiod_active == 0) {
                LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_GPIOD);
            }
            break;
    }
}

static void _gpio_set_af(GPIO_TypeDef *gpio, uint32_t pin, uint32_t alternate) {
    switch(pin) {
        case LL_GPIO_PIN_0:
        case LL_GPIO_PIN_1:
        case LL_GPIO_PIN_2:
        case LL_GPIO_PIN_3:
        case LL_GPIO_PIN_4:
        case LL_GPIO_PIN_5:
        case LL_GPIO_PIN_6:
        case LL_GPIO_PIN_7:
            LL_GPIO_SetAFPin_0_7(gpio, pin, alternate);
            break;

        case LL_GPIO_PIN_8:
        case LL_GPIO_PIN_9:
        case LL_GPIO_PIN_10:
        case LL_GPIO_PIN_11:
        case LL_GPIO_PIN_12:
        case LL_GPIO_PIN_13:
        case LL_GPIO_PIN_14:
        case LL_GPIO_PIN_15:
            LL_GPIO_SetAFPin_8_15(gpio, pin, alternate);
            break;
    }
}

void gpio_init_digital(gpio_pin_t pin, gpio_digital_mode_t mode, gpio_pull_t pull) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);
    passert(titan_pin_settings[pin].mode == 0);

    _gpio_init_gpio(pin);

    uint32_t mode_real = 0;
    uint32_t output_type_real = 0;
    switch(mode) {
        case GPIO_MODE_INPUT:
            mode_real = LL_GPIO_MODE_INPUT;
            break;

        case GPIO_MODE_OUTPUT_PP:
            mode_real = LL_GPIO_MODE_OUTPUT;
            output_type_real = LL_GPIO_OUTPUT_PUSHPULL;
            break;

        case GPIO_MODE_OUTPUT_OD:
            mode_real = LL_GPIO_MODE_OUTPUT;
            output_type_real = LL_GPIO_OUTPUT_OPENDRAIN;
            break;

        default:
            passert(0);
            break;
    }

    uint32_t pull_real = 0;
    switch(pull) {
        case GPIO_PULL_NOPULL:
            pull_real = LL_GPIO_PULL_NO;
            break;

        case GPIO_PULL_UP:
            pull_real = LL_GPIO_PULL_UP;
            break;

        case GPIO_PULL_DOWN:
            pull_real = LL_GPIO_PULL_DOWN;
            break;

        default:
            passert(0);
            break;
    }


    titan_pin_settings[pin].mode = (uint8_t)mode;
    
    LL_GPIO_SetPinMode(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, mode_real);
    if(mode & (GPIO_MODE_OUTPUT_OD | GPIO_MODE_OUTPUT_PP)) {
        LL_GPIO_SetPinOutputType(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, output_type_real);
        LL_GPIO_SetPinSpeed(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_SPEED_FREQ_LOW);
    }
    LL_GPIO_SetPinPull(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, pull_real);
}

void gpio_init_interrupt(gpio_pin_t pin, gpio_interrupt_mode_t mode, gpio_pull_t pull, gpio_isr_t callback) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);
    passert(titan_pin_settings[pin].mode == 0);
    passert(callback != 0);

    gpio_init_digital(pin, GPIO_MODE_INPUT, pull);

    if(exti_active == 0) {
        LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);
    }
    exti_active |= titan_pin_defs[pin].pin;

    uint32_t exti_source_port;
    switch((uint32_t)titan_pin_defs[pin].gpio) {
        case (uint32_t)GPIOA:
            exti_source_port = LL_SYSCFG_EXTI_PORTA;
            break;

        case (uint32_t)GPIOB:
            exti_source_port = LL_SYSCFG_EXTI_PORTB;
            break;

        case (uint32_t)GPIOC:
            exti_source_port = LL_SYSCFG_EXTI_PORTC;
            break;

        case (uint32_t)GPIOD:
            exti_source_port = LL_SYSCFG_EXTI_PORTD;
            break;

        default:
            passert(0);
            break;
    }

    uint32_t exti_source_line;
    switch((uint32_t)titan_pin_defs[pin].pin) {
        case LL_GPIO_PIN_0:
            exti_source_line = LL_SYSCFG_EXTI_LINE0;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_0;
            titan_pin_settings[pin].exti_irq = EXTI0_IRQn;
            exti_pin[0] = pin;
            break;

        case LL_GPIO_PIN_1:
            exti_source_line = LL_SYSCFG_EXTI_LINE1;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_1;
            titan_pin_settings[pin].exti_irq = EXTI1_IRQn;
            exti_pin[1] = pin;
            break;

        case LL_GPIO_PIN_2:
            exti_source_line = LL_SYSCFG_EXTI_LINE2;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_2;
            titan_pin_settings[pin].exti_irq = EXTI2_IRQn;
            exti_pin[2] = pin;
            break;

        case LL_GPIO_PIN_3:
            exti_source_line = LL_SYSCFG_EXTI_LINE3;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_3;
            titan_pin_settings[pin].exti_irq = EXTI3_IRQn;
            exti_pin[3] = pin;
            break;

