adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
        case LL_GPIO_PIN_4:
            exti_source_line = LL_SYSCFG_EXTI_LINE4;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_4;
            titan_pin_settings[pin].exti_irq = EXTI4_IRQn;
            exti_pin[4] = pin;
            break;

        case LL_GPIO_PIN_5:
            exti_source_line = LL_SYSCFG_EXTI_LINE5;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_5;
            titan_pin_settings[pin].exti_irq = EXTI9_5_IRQn;
            exti_pin[5] = pin;
            break;

        case LL_GPIO_PIN_6:
            exti_source_line = LL_SYSCFG_EXTI_LINE6;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_6;
            titan_pin_settings[pin].exti_irq = EXTI9_5_IRQn;
            exti_pin[6] = pin;
            break;

        case LL_GPIO_PIN_7:
            exti_source_line = LL_SYSCFG_EXTI_LINE7;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_7;
            titan_pin_settings[pin].exti_irq = EXTI9_5_IRQn;
            exti_pin[7] = pin;
            break;

        case LL_GPIO_PIN_8:
            exti_source_line = LL_SYSCFG_EXTI_LINE8;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_8;
            titan_pin_settings[pin].exti_irq = EXTI9_5_IRQn;
            exti_pin[8] = pin;
            break;

        case LL_GPIO_PIN_9:
            exti_source_line = LL_SYSCFG_EXTI_LINE9;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_9;
            titan_pin_settings[pin].exti_irq = EXTI9_5_IRQn;
            exti_pin[9] = pin;
            break;

        case LL_GPIO_PIN_10:
            exti_source_line = LL_SYSCFG_EXTI_LINE10;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_10;
            titan_pin_settings[pin].exti_irq = EXTI15_10_IRQn;
            exti_pin[10] = pin;
            break;

        case LL_GPIO_PIN_11:
            exti_source_line = LL_SYSCFG_EXTI_LINE11;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_11;
            titan_pin_settings[pin].exti_irq = EXTI15_10_IRQn;
            exti_pin[11] = pin;
            break;

        case LL_GPIO_PIN_12:
            exti_source_line = LL_SYSCFG_EXTI_LINE12;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_12;
            titan_pin_settings[pin].exti_irq = EXTI15_10_IRQn;
            exti_pin[12] = pin;
            break;

        case LL_GPIO_PIN_13:
            exti_source_line = LL_SYSCFG_EXTI_LINE13;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_13;
            titan_pin_settings[pin].exti_irq = EXTI15_10_IRQn;
            exti_pin[13] = pin;
            break;

        case LL_GPIO_PIN_14:
            exti_source_line = LL_SYSCFG_EXTI_LINE14;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_14;
            titan_pin_settings[pin].exti_irq = EXTI15_10_IRQn;
            exti_pin[14] = pin;
            break;

        case LL_GPIO_PIN_15:
            exti_source_line = LL_SYSCFG_EXTI_LINE15;
            titan_pin_settings[pin].exti_line = LL_EXTI_LINE_15;
            titan_pin_settings[pin].exti_irq = EXTI15_10_IRQn;
            exti_pin[15] = pin;
            break;

        default:
            passert(0);
            break;
    }

    LL_SYSCFG_SetEXTISource(exti_source_port, exti_source_line);

    titan_pin_settings[pin].mode = (uint8_t)mode;
    titan_pin_settings[pin].exti = callback;

    LL_EXTI_EnableIT_0_31(titan_pin_settings[pin].exti_line);
    switch(mode) {
        case GPIO_MODE_INTERRUPT_REDGE:
            LL_EXTI_EnableRisingTrig_0_31(titan_pin_settings[pin].exti_line);
            break;

        case GPIO_MODE_INTERRUPT_FEDGE:
            LL_EXTI_EnableFallingTrig_0_31(titan_pin_settings[pin].exti_line);
            break;

        case GPIO_MODE_INTERRUPT_RFEDGE:
            LL_EXTI_EnableRisingTrig_0_31(titan_pin_settings[pin].exti_line);
            LL_EXTI_EnableFallingTrig_0_31(titan_pin_settings[pin].exti_line);
            break;

        default:
            passert(0);
            break;
    }

    switch(titan_pin_settings[pin].exti_irq) {
        case EXTI0_IRQn:
        case EXTI1_IRQn:
        case EXTI2_IRQn:
        case EXTI3_IRQn:
        case EXTI4_IRQn:
            NVIC_EnableIRQ(titan_pin_settings[pin].exti_irq); 
            NVIC_SetPriority(titan_pin_settings[pin].exti_irq, 0);    //checkAL priority
            break;

        case EXTI9_5_IRQn:
            if(exti9_5_active == 0) {
                NVIC_EnableIRQ(titan_pin_settings[pin].exti_irq); 
                NVIC_SetPriority(titan_pin_settings[pin].exti_irq, 0);    //checkAL priority
            }
            exti9_5_active |= titan_pin_defs[pin].pin;
            break;

        case EXTI15_10_IRQn:
            if(exti15_10_active == 0) {
                NVIC_EnableIRQ(titan_pin_settings[pin].exti_irq); 
                NVIC_SetPriority(titan_pin_settings[pin].exti_irq, 0);    //checkAL priority
            }
            exti15_10_active |= titan_pin_defs[pin].pin;
            break;

        default:
            passert(0);
            break;
    }
}


void gpio_init_interrupt_param(gpio_pin_t pin, gpio_interrupt_mode_t mode, gpio_pull_t pull, gpio_isr_param_t callback, uint32_t param) {
    gpio_init_interrupt(pin, mode, pull, (gpio_isr_t)callback);
    titan_pin_settings[pin].exti_param = callback;
    titan_pin_settings[pin].param = param;
    titan_pin_settings[pin].exti = 0;
}


void gpio_init_analog(gpio_pin_t pin, gpio_analog_mode_t mode, uint32_t bits) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);
    passert(titan_pin_settings[pin].mode == 0);
    passert((bits == 8) || (bits == 12));

    _gpio_init_gpio(pin);

    uint8_t channel = titan_pin_defs[pin].adc & 0xF;
    if(channel == 0) {
        channel = 16;
    }

    switch(mode) {
        case GPIO_MODE_ANALOG_IN:
            passert(titan_pin_defs[pin].adc != 0);

            if(adc1_active == 0) {
                if(adc1_semaphore_created == 0) {
                    semaphore_create(&adc1_semaphore, 1);
                    adc1_semaphore_created = 1;
                }

                NVIC_SetPriority(ADC1_IRQn, 0);         //checkAL interrupt priority
                NVIC_EnableIRQ(ADC1_IRQn);
                LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_ADC);
                LL_ADC_SetCommonClock(__LL_ADC_COMMON_INSTANCE(ADC1), LL_ADC_CLOCK_SYNC_PCLK_DIV2);

                adc1_bits = bits;
                switch(bits) {
                    case 8:
                        LL_ADC_SetResolution(ADC1, LL_ADC_RESOLUTION_8B);
                        break;

