adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
                    case 12:
                        LL_ADC_SetResolution(ADC1, LL_ADC_RESOLUTION_12B);
                        break;
                }

                LL_ADC_SetDataAlignment(ADC1, LL_ADC_DATA_ALIGN_RIGHT);
                LL_ADC_SetLowPowerMode(ADC1, LL_ADC_LP_MODE_NONE);

                LL_ADC_REG_SetTriggerSource(ADC1, LL_ADC_REG_TRIG_SOFTWARE);
                LL_ADC_REG_SetContinuousMode(ADC1, LL_ADC_REG_CONV_SINGLE);
                LL_ADC_REG_SetDMATransfer(ADC1, LL_ADC_REG_DMA_TRANSFER_NONE);
                LL_ADC_REG_SetOverrun(ADC1, LL_ADC_REG_OVR_DATA_OVERWRITTEN);
                LL_ADC_REG_SetSequencerLength(ADC1, LL_ADC_REG_SEQ_SCAN_DISABLE);

                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_1, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_1, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_2, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_2, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_3, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_3, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_4, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_4, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_5, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_5, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_6, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_6, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_7, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_7, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_8, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_8, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_9, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_9, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_10, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_10, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_11, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_11, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_12, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_12, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_13, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_13, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_14, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_14, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_15, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_15, LL_ADC_SINGLE_ENDED);
                LL_ADC_SetChannelSamplingTime(ADC1, LL_ADC_CHANNEL_16, ADC_SAMPLING_TIME);
                LL_ADC_SetChannelSingleDiff(ADC1, LL_ADC_CHANNEL_16, LL_ADC_SINGLE_ENDED);

                LL_ADC_EnableIT_EOC(ADC1);

                LL_ADC_DisableDeepPowerDown(ADC1);
                LL_ADC_EnableInternalRegulator(ADC1);

                LL_ADC_StartCalibration(ADC1, LL_ADC_SINGLE_ENDED);
    
                while (LL_ADC_IsCalibrationOnGoing(ADC1) != 0);

                LL_ADC_Enable(ADC1);
                
                /* Poll for ADC ready to convert */
                while (LL_ADC_IsActiveFlag_ADRDY(ADC1) == 0);
            }

            adc1_active |= (1 << channel);
            break;

        case GPIO_MODE_ANALOG_OUT:
            passert(titan_pin_defs[pin].dac != 0);

            LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_DAC1);
            LL_DAC_SetMode(DAC1, LL_DAC_CHANNEL_1, LL_DAC_MODE_NORMAL_OPERATION);
            LL_DAC_SetTriggerSource(DAC1, LL_DAC_CHANNEL_1, LL_DAC_TRIG_SOFTWARE);
            LL_DAC_ConfigOutput(DAC1, LL_DAC_CHANNEL_1, LL_DAC_OUTPUT_MODE_NORMAL, LL_DAC_OUTPUT_BUFFER_ENABLE, LL_DAC_OUTPUT_CONNECT_GPIO);

            LL_DAC_DisableDMAReq(DAC1, LL_DAC_CHANNEL_1);
            LL_DAC_ConvertData12RightAligned(DAC1, LL_DAC_CHANNEL_1, 0);

            LL_DAC_Enable(DAC1, LL_DAC_CHANNEL_1);
            LL_DAC_EnableTrigger(DAC1, LL_DAC_CHANNEL_1);
            break;

        default:
            passert(0);
            break;
    }

    titan_pin_settings[pin].mode = mode;
    titan_pin_settings[pin].bits = bits;

    LL_GPIO_SetPinMode(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_MODE_ANALOG);
    LL_GPIO_SetPinSpeed(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_SPEED_FREQ_LOW);
    LL_GPIO_SetPinPull(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_PULL_NO);
}

void gpio_init_special(gpio_pin_t pin, gpio_special_function_t function, uint32_t param) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);
    passert(titan_pin_settings[pin].mode == 0);

    _gpio_init_gpio(pin);

    uint32_t output_type_real;
    uint32_t pull_real;
    uint32_t speed_real;
    LL_GPIO_SetPinMode(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_MODE_ALTERNATE);

    switch(function) {
        case GPIO_SPECIAL_FUNCTION_I2C:
            output_type_real = LL_GPIO_OUTPUT_OPENDRAIN;
            pull_real = LL_GPIO_PULL_UP;
            speed_real = LL_GPIO_SPEED_FREQ_HIGH;
            switch(param) {
                case (uint32_t)I2C1:
                    if(titan_pin_defs[pin].af4 == AF_I2C1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_4);
                    }
                    else {
                        passert(0);
                    }
                    break;

