adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
                case (uint32_t)I2C2:
                    if(titan_pin_defs[pin].af4 == AF_I2C2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_4);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)I2C3:
                    if(titan_pin_defs[pin].af4 == AF_I2C3) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_4);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)I2C4:
                    if(titan_pin_defs[pin].af2 == AF_I2C4) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_2);
                    }
                    else if(titan_pin_defs[pin].af3 == AF_I2C4) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_3);
                    }
                    else if(titan_pin_defs[pin].af4 == AF_I2C4) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_4);
                    }
                    else if(titan_pin_defs[pin].af5 == AF_I2C4) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_5);
                    }
                    else {
                        passert(0);
                    }
                    break;

                default:
                    passert(0);
                    break;
            }

            LL_GPIO_SetPinSpeed(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, speed_real);
            LL_GPIO_SetPinOutputType(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, output_type_real);
            LL_GPIO_SetPinPull(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, pull_real);
            break;

        case GPIO_SPECIAL_FUNCTION_SDMMC:

            if(titan_pin_defs[pin].af12 == AF_SDMMC1) {
                _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_12);
            }
            else {
                passert(0);
            }
            break;

        case GPIO_SPECIAL_FUNCTION_SPI:
            output_type_real = LL_GPIO_OUTPUT_PUSHPULL;
            pull_real = LL_GPIO_PULL_DOWN;
            speed_real = LL_GPIO_SPEED_FREQ_HIGH;
            switch(param) {
                case (uint32_t)SPI1:
                    if(titan_pin_defs[pin].af5 == AF_SPI1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_5);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)SPI2:
                    if(titan_pin_defs[pin].af5 == AF_SPI2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_5);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)SPI3:
                    if(titan_pin_defs[pin].af6 == AF_SPI3) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_6);
                    }
                    else {
                        passert(0);
                    }
                    break;

                default:
                    passert(0);
                    break;
            }

            LL_GPIO_SetPinSpeed(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, speed_real);
            LL_GPIO_SetPinOutputType(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, output_type_real);
            LL_GPIO_SetPinPull(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, pull_real);
            break;

        case GPIO_SPECIAL_FUNCTION_TIMER:
            switch(param) {
                case (uint32_t)TIM1:
                    if(titan_pin_defs[pin].af1 == AF_TIM1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_1);
                    }
                    else if(titan_pin_defs[pin].af2 == AF_TIM1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_2);
                    }
                    else if(titan_pin_defs[pin].af3 == AF_TIM1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_3);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)TIM2:
                    if(titan_pin_defs[pin].af1 == AF_TIM2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_1);
                    }
                    else if(titan_pin_defs[pin].af2 == AF_TIM2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_2);
                    }
                    else if(titan_pin_defs[pin].af14 == AF_TIM2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_14);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)TIM3:
                    if(titan_pin_defs[pin].af2 == AF_TIM3) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_2);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)TIM15:
                    if(titan_pin_defs[pin].af14 == AF_TIM15) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_14);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)TIM16:
                    if(titan_pin_defs[pin].af14 == AF_TIM16) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_14);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)LPTIM1:
                    if(titan_pin_defs[pin].af1 == AF_LPTIM1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_1);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)LPTIM2:
                    if(titan_pin_defs[pin].af14 == AF_LPTIM2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_14);
                    }
                    else {
                        passert(0);
                    }
                    break;


                    default:
                        passert(0);
                        break;
            }
            break;

        case GPIO_SPECIAL_FUNCTION_UART:
            output_type_real = LL_GPIO_OUTPUT_PUSHPULL;
            pull_real = LL_GPIO_PULL_UP;
            speed_real = LL_GPIO_SPEED_FREQ_HIGH;
            switch(param) {
                case (uint32_t)USART1:
                    if(titan_pin_defs[pin].af7 == AF_UART1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_7);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)USART2:
                    if(titan_pin_defs[pin].af3 == AF_UART2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_3);
                    }
                    else if(titan_pin_defs[pin].af7 == AF_UART2) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_7);
                    }
                    else {
                        passert(0);
                    }
                    break;

