adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
                case (uint32_t)USART3:
                    if(titan_pin_defs[pin].af7 == AF_UART3) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_7);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)UART4:
                    if(titan_pin_defs[pin].af8 == AF_UART4) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_8);
                    }
                    else {
                        passert(0);
                    }
                    break;

                case (uint32_t)LPUART1:
                    if(titan_pin_defs[pin].af8 == AF_LPUART1) {
                        _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_8);
                    }
                    else {
                        passert(0);
                    }
                    break;

                default:
                    passert(0);
                    break;
            }

            LL_GPIO_SetPinSpeed(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, speed_real);
            LL_GPIO_SetPinOutputType(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, output_type_real);
            LL_GPIO_SetPinPull(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, pull_real);
            break;

        case GPIO_SPECIAL_FUNCTION_USB:
            if(titan_pin_defs[pin].af10 == AF_USB) {
                _gpio_set_af(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_AF_10);
            }
            else {
                passert(0);
            }
            break;

        default:
            passert(0);
            break;
    }
}

void gpio_init_pwm(gpio_pin_t pin, gpio_digital_mode_t mode, gpio_pull_t pull, uint32_t initial_value) {
    passert(titan_pin_defs[pin].pwm != 0);

    uint32_t *timer_active = &tim1_active;
    TIM_TypeDef* timer;
    uint32_t timer_no = (titan_pin_defs[pin].pwm >> 4);
    uint32_t channel = (titan_pin_defs[pin].pwm & 0x0F);

    switch(timer_no) {
        case 1:
            timer = TIM1;
            timer_active = &tim1_active;
            break;

        case 3:
            timer = TIM3;
            timer_active = &tim3_active;
            break;

        default:
            passert(0);
            break;
    }

    passert((*timer_active & (1 << channel)) == 0);
    gpio_init_special(pin, GPIO_SPECIAL_FUNCTION_TIMER, (uint32_t)timer);


    uint32_t output_type_real = 0;
    switch(mode) {
        case GPIO_MODE_INPUT:
            passert(0); //this should not be selected
            break;

        case GPIO_MODE_OUTPUT_PP:
            output_type_real = LL_GPIO_OUTPUT_PUSHPULL;
            break;

        case GPIO_MODE_OUTPUT_OD:
            output_type_real = LL_GPIO_OUTPUT_OPENDRAIN;
            break;

        default:
            passert(0);
            break;
    }

    uint32_t pull_real = 0;
    switch(pull) {
        case GPIO_PULL_NOPULL:
            pull_real = LL_GPIO_PULL_NO;
            break;

        case GPIO_PULL_UP:
            pull_real = LL_GPIO_PULL_UP;
            break;

        case GPIO_PULL_DOWN:
            pull_real = LL_GPIO_PULL_DOWN;
            break;

        default:
            passert(0);
            break;
    }

    LL_GPIO_SetPinSpeed(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_SPEED_FREQ_HIGH);
    LL_GPIO_SetPinOutputType(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, output_type_real);
    LL_GPIO_SetPinPull(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, pull_real);

    if(*timer_active == 0) {
        switch(timer_no) {
            case 1:
                LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_TIM1);
                break;

            case 3:
                LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_TIM3);
                break;
        }

        LL_TIM_SetPrescaler(timer, 79);
        LL_TIM_EnableARRPreload(timer);
        LL_TIM_SetAutoReload(timer, 0xFFFE);
        LL_TIM_EnableCounter(timer);
        LL_TIM_GenerateEvent_UPDATE(timer);
        LL_TIM_EnableAllOutputs(timer);
    }

    initial_value = (initial_value != 0) * 0xFFFF;

    switch(channel) {
        case 1:
            LL_TIM_OC_SetMode(timer, LL_TIM_CHANNEL_CH1, LL_TIM_OCMODE_PWM1);
            LL_TIM_OC_SetCompareCH1(timer, initial_value);    //write duty
            LL_TIM_OC_EnablePreload(timer, LL_TIM_CHANNEL_CH1);
            LL_TIM_CC_EnableChannel(timer, LL_TIM_CHANNEL_CH1);
            break;

        case 2:
            LL_TIM_OC_SetMode(timer, LL_TIM_CHANNEL_CH2, LL_TIM_OCMODE_PWM1);
            LL_TIM_OC_SetCompareCH2(timer, initial_value);    //write duty
            LL_TIM_OC_EnablePreload(timer, LL_TIM_CHANNEL_CH2);
            LL_TIM_CC_EnableChannel(timer, LL_TIM_CHANNEL_CH2);
            break;

        case 3:
            LL_TIM_OC_SetMode(timer, LL_TIM_CHANNEL_CH3, LL_TIM_OCMODE_PWM1);
            LL_TIM_OC_SetCompareCH3(timer, initial_value);    //write duty
            LL_TIM_OC_EnablePreload(timer, LL_TIM_CHANNEL_CH3);
            LL_TIM_CC_EnableChannel(timer, LL_TIM_CHANNEL_CH3);
            break;

        case 4:
            LL_TIM_OC_SetMode(timer, LL_TIM_CHANNEL_CH4, LL_TIM_OCMODE_PWM1);
            LL_TIM_OC_SetCompareCH4(timer, initial_value);    //write duty
            LL_TIM_OC_EnablePreload(timer, LL_TIM_CHANNEL_CH4);
            LL_TIM_CC_EnableChannel(timer, LL_TIM_CHANNEL_CH4);
            break;
    }

    *timer_active |= (1 << channel);
}

void gpio_deinit(gpio_pin_t pin) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);

    _gpio_deinit_gpio(pin);
    LL_GPIO_SetPinMode(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_MODE_INPUT);
    LL_GPIO_SetPinSpeed(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_SPEED_FREQ_LOW);
    LL_GPIO_SetPinPull(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin, LL_GPIO_PULL_NO);

    switch(titan_pin_settings[pin].mode) {
        case GPIO_MODE_INTERRUPT_REDGE:
        case GPIO_MODE_INTERRUPT_FEDGE:
        case GPIO_MODE_INTERRUPT_RFEDGE:
            //disable EXTI IRQ
            switch(titan_pin_settings[pin].exti_irq) {
                case EXTI0_IRQn:
                case EXTI1_IRQn:
                case EXTI2_IRQn:
                case EXTI3_IRQn:
                case EXTI4_IRQn:
                    NVIC_DisableIRQ(titan_pin_settings[pin].exti_irq); 
                    break;

                case EXTI9_5_IRQn:
                    exti9_5_active &= ~titan_pin_defs[pin].pin;
                    if(exti9_5_active == 0) {
                        NVIC_DisableIRQ(titan_pin_settings[pin].exti_irq); 
                    }
                    break;

                case EXTI15_10_IRQn:
                    exti15_10_active &= ~titan_pin_defs[pin].pin;
                    if(exti15_10_active == 0) {
                        NVIC_DisableIRQ(titan_pin_settings[pin].exti_irq); 
                    }
                    break;
                
                default:
                    passert(0);
                    break;
            }

            //disable EXTI
            LL_EXTI_DisableIT_0_31(titan_pin_settings[pin].exti_line);
            LL_EXTI_DisableRisingTrig_0_31(titan_pin_settings[pin].exti_line);
            LL_EXTI_DisableFallingTrig_0_31(titan_pin_settings[pin].exti_line);

            exti_active &= ~titan_pin_defs[pin].pin;
            if(exti_active == 0) {
               LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_SYSCFG);   
            }

            exti_pin[pin] = 0;
            titan_pin_settings[pin].exti = 0;
            titan_pin_settings[pin].exti_param = 0;
            titan_pin_settings[pin].exti_irq = (IRQn_Type)0;
            titan_pin_settings[pin].exti_line = 0;
            break;

        case GPIO_SPECIAL_FUNCTION_TIMER: {  //pwm mode
            uint32_t *timer_active = &tim1_active;
            TIM_TypeDef* timer;
            uint32_t timer_no = (titan_pin_defs[pin].pwm >> 4);
            uint32_t channel = (titan_pin_defs[pin].pwm & 0x0F);

            switch(timer_no) {
                case 1:
                    timer = TIM1;
                    timer_active = &tim1_active;
                    break;

                case 3:
                    timer = TIM3;
                    timer_active = &tim3_active;
                    break;

                default:
                    passert(0);
                    break;
            }

            switch(channel) {
                case 1:
                    LL_TIM_OC_DisablePreload(timer, LL_TIM_CHANNEL_CH1);
                    LL_TIM_CC_DisableChannel(timer, LL_TIM_CHANNEL_CH1);
                    break;

