adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
                case 2:
                    LL_TIM_OC_DisablePreload(timer, LL_TIM_CHANNEL_CH2);
                    LL_TIM_CC_DisableChannel(timer, LL_TIM_CHANNEL_CH2);
                    break;

                case 3:
                    LL_TIM_OC_DisablePreload(timer, LL_TIM_CHANNEL_CH3);
                    LL_TIM_CC_DisableChannel(timer, LL_TIM_CHANNEL_CH3);
                    break;

                case 4:
                    LL_TIM_OC_DisablePreload(timer, LL_TIM_CHANNEL_CH4);
                    LL_TIM_CC_DisableChannel(timer, LL_TIM_CHANNEL_CH4);
                    break;
            }

            *timer_active &= ~(1 << channel);

            //also clear the timer
            if(*timer_active == 0) {
                LL_TIM_DisableARRPreload(timer);
                LL_TIM_DisableCounter(timer);
                LL_TIM_GenerateEvent_UPDATE(timer);
                LL_TIM_DisableAllOutputs(timer);

                switch(timer_no) {
                    case 1:
                        LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_TIM1);
                        break;

                    case 3:
                        LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_TIM3);
                        break;
                }
            }
        } break;

        case GPIO_MODE_ANALOG_OUT:
            LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_DAC1);
            LL_DAC_Disable(DAC1, LL_DAC_CHANNEL_1);
            LL_DAC_DisableTrigger(DAC1, LL_DAC_CHANNEL_1);
            break;

        case GPIO_MODE_ANALOG_IN:
            LL_ADC_Disable(ADC1);
            LL_ADC_DisableIT_EOC(ADC1);
            LL_ADC_DisableInternalRegulator(ADC1);
            LL_AHB2_GRP1_DisableClock(LL_AHB2_GRP1_PERIPH_ADC);
            NVIC_DisableIRQ(ADC1_IRQn);
            break;
    }

    titan_pin_settings[pin].mode = 0;
}


uint32_t gpio_digital_read(gpio_pin_t pin) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);

    return LL_GPIO_IsInputPinSet(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin);
}

void gpio_digital_write(gpio_pin_t pin, uint32_t value) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);

    if(value) {
        LL_GPIO_SetOutputPin(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin);
    }
    else {
        LL_GPIO_ResetOutputPin(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin);
    }
}

void gpio_digital_toggle(gpio_pin_t pin) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);

    LL_GPIO_TogglePin(titan_pin_defs[pin].gpio, titan_pin_defs[pin].pin);
}

uint32_t gpio_analog_read(gpio_pin_t pin) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);
    passert(titan_pin_settings[pin].mode == GPIO_MODE_ANALOG_IN);

    semaphore_lock(&adc1_semaphore);
    uint32_t ll_channel = LL_ADC_CHANNEL_1;

    volatile kernel_atomic_t __atomic;
    kernel_begin_critical(&__atomic);
    adc1_waiting_task = (task_t*)kernel_current_task;

    uint8_t channel = titan_pin_defs[pin].adc & 0xF;
    switch(channel) {
        case 0:
            ll_channel = LL_ADC_CHANNEL_16;
            break;

        case 1:
            ll_channel = LL_ADC_CHANNEL_1;
            break;

        case 2:
            ll_channel = LL_ADC_CHANNEL_2;
            break;

        case 3:
            ll_channel = LL_ADC_CHANNEL_3;
            break;

        case 4:
            ll_channel = LL_ADC_CHANNEL_4;
            break;

        case 5:
            ll_channel = LL_ADC_CHANNEL_5;
            break;

        case 6:
            ll_channel = LL_ADC_CHANNEL_6;
            break;

        case 7:
            ll_channel = LL_ADC_CHANNEL_7;
            break;

        case 8:
            ll_channel = LL_ADC_CHANNEL_8;
            break;

        case 9:
            ll_channel = LL_ADC_CHANNEL_9;
            break;

        case 10:
            ll_channel = LL_ADC_CHANNEL_10;
            break;

        case 11:
            ll_channel = LL_ADC_CHANNEL_11;
            break;

        case 12:
            ll_channel = LL_ADC_CHANNEL_12;
            break;

        case 13:
            ll_channel = LL_ADC_CHANNEL_13;
            break;

        case 14:
            ll_channel = LL_ADC_CHANNEL_14;
            break;

        case 15:
            ll_channel = LL_ADC_CHANNEL_15;
            break;
    }
    
    LL_ADC_REG_SetSequencerRanks(ADC1, LL_ADC_REG_RANK_1, ll_channel);
    LL_ADC_REG_StartConversion(ADC1);

    kernel_scheduler_io_wait_start();
    kernel_scheduler_trigger();
    kernel_end_critical(&__atomic);

    uint32_t result = adc1_result;
    if(adc1_bits < titan_pin_settings[pin].bits) {
        result <<= (titan_pin_settings[pin].bits - adc1_bits);
    }
    else if(adc1_bits > titan_pin_settings[pin].bits) {
        result >>= (adc1_bits - titan_pin_settings[pin].bits);
    }

    semaphore_unlock(&adc1_semaphore);
    return result;
}

void gpio_analog_write(gpio_pin_t pin, uint32_t value) {
    passert(pin < TITAN_GPIO_TOTAL_PINS);
    passert(titan_pin_settings[pin].mode == GPIO_MODE_ANALOG_OUT);

    if(titan_pin_settings[pin].bits == 8) {
        LL_DAC_ConvertData8RightAligned(DAC1, LL_DAC_CHANNEL_1, value);
    }
    else {
        LL_DAC_ConvertData12RightAligned(DAC1, LL_DAC_CHANNEL_1, value);
    }

    LL_DAC_TrigSWConversion(DAC1, LL_DAC_CHANNEL_1);
}

void gpio_pwm_write_frequency(gpio_pin_t pin, uint32_t frequency) {
    uint32_t timer = (titan_pin_defs[pin].pwm >> 4);

    switch(timer) {
        case 1:
            timer = (uint32_t)TIM1;
            break;

        case 3:
            timer = (uint32_t)TIM3;
            break;

        default:
            passert(0);
            break;
    }
    
    uint32_t prescaler = 1;
    uint32_t autoreload = SystemCoreClock / frequency;
    if(autoreload > 65535) {
        prescaler = (autoreload / 65536) + 1;
        autoreload = SystemCoreClock / prescaler / frequency;
    }

    //TimerClock =  SystemCoreClock / Prescaler - 1
    //ARR = TimerClock/Frequency * Prescaler + 1

    LL_TIM_SetPrescaler((TIM_TypeDef*)timer, prescaler - 1);
    LL_TIM_SetAutoReload((TIM_TypeDef*)timer, autoreload);
}

void gpio_pwm_write_duty(gpio_pin_t pin, uint32_t duty) {
    uint32_t timer = (titan_pin_defs[pin].pwm >> 4);
    uint32_t channel = (titan_pin_defs[pin].pwm & 0x0F);

    switch(timer) {
        case 1:
            timer = (uint32_t)TIM1;
            break;

        case 3:
            timer = (uint32_t)TIM3;
            break;

        default:
            passert(0);
            break;
    }

    switch(channel) {
        case 1:
            LL_TIM_OC_SetCompareCH1((TIM_TypeDef*)timer, duty);
            break;

