adrianlita/titan/bsp/stm32l4/periph-stm32l452/gpio.c
        case 2:
            LL_TIM_OC_SetCompareCH2((TIM_TypeDef*)timer, duty);
            break;

        case 3:
            LL_TIM_OC_SetCompareCH3((TIM_TypeDef*)timer, duty);
            break;

        case 4:
            LL_TIM_OC_SetCompareCH4((TIM_TypeDef*)timer, duty);
            break;
    }
}

uint32_t gpio_pwm_get_max_duty(gpio_pin_t pin) {
    uint32_t timer = (titan_pin_defs[pin].pwm >> 4);
    
    switch(timer) {
        case 1:
            timer = (uint32_t)TIM1;
            break;

        case 3:
            timer = (uint32_t)TIM3;
            break;

        default:
            passert(0);
            break;
    }

    return LL_TIM_GetAutoReload((TIM_TypeDef*)timer) + 1;
}


void EXTI0_IRQHandler(void) {
    if(LL_EXTI_IsActiveFlag_0_31(titan_pin_settings[exti_pin[0]].exti_line) != RESET)
    {
        LL_EXTI_ClearFlag_0_31(titan_pin_settings[exti_pin[0]].exti_line);

        if(titan_pin_settings[exti_pin[0]].exti) {
            titan_pin_settings[exti_pin[0]].exti();
        }
        else if(titan_pin_settings[exti_pin[0]].exti_param) {
            titan_pin_settings[exti_pin[0]].exti_param(titan_pin_settings[exti_pin[0]].param);
        }
    }
}

void EXTI1_IRQHandler(void) {
    if(LL_EXTI_IsActiveFlag_0_31(titan_pin_settings[exti_pin[1]].exti_line) != RESET)
    {
        LL_EXTI_ClearFlag_0_31(titan_pin_settings[exti_pin[1]].exti_line);

        if(titan_pin_settings[exti_pin[1]].exti) {
            titan_pin_settings[exti_pin[1]].exti();
        }
        else if(titan_pin_settings[exti_pin[1]].exti_param) {
            titan_pin_settings[exti_pin[1]].exti_param(titan_pin_settings[exti_pin[1]].param);
        }
    }
}

void EXTI2_IRQHandler(void) {
    if(LL_EXTI_IsActiveFlag_0_31(titan_pin_settings[exti_pin[2]].exti_line) != RESET)
    {
        LL_EXTI_ClearFlag_0_31(titan_pin_settings[exti_pin[2]].exti_line);

        if(titan_pin_settings[exti_pin[2]].exti) {
            titan_pin_settings[exti_pin[2]].exti();
        }
        else if(titan_pin_settings[exti_pin[2]].exti_param) {
            titan_pin_settings[exti_pin[2]].exti_param(titan_pin_settings[exti_pin[2]].param);
        }
    }
}

void EXTI3_IRQHandler(void) {
    if(LL_EXTI_IsActiveFlag_0_31(titan_pin_settings[exti_pin[3]].exti_line) != RESET)
    {
        LL_EXTI_ClearFlag_0_31(titan_pin_settings[exti_pin[3]].exti_line);

        if(titan_pin_settings[exti_pin[3]].exti) {
            titan_pin_settings[exti_pin[3]].exti();
        }
        else if(titan_pin_settings[exti_pin[3]].exti_param) {
            titan_pin_settings[exti_pin[3]].exti_param(titan_pin_settings[exti_pin[3]].param);
        }
    }
}

void EXTI4_IRQHandler(void) {
    if(LL_EXTI_IsActiveFlag_0_31(titan_pin_settings[exti_pin[4]].exti_line) != RESET)
    {
        LL_EXTI_ClearFlag_0_31(titan_pin_settings[exti_pin[4]].exti_line);

        if(titan_pin_settings[exti_pin[4]].exti) {
            titan_pin_settings[exti_pin[4]].exti();
        }
        else if(titan_pin_settings[exti_pin[4]].exti_param) {
            titan_pin_settings[exti_pin[4]].exti_param(titan_pin_settings[exti_pin[4]].param);
        }
    }
}


void EXTI9_5_IRQHandler(void) {
    for(uint8_t i = 5; i < 10; i++) {
        if(LL_EXTI_IsActiveFlag_0_31(titan_pin_settings[exti_pin[i]].exti_line) != RESET)
        {
            LL_EXTI_ClearFlag_0_31(titan_pin_settings[exti_pin[i]].exti_line);

            if(titan_pin_settings[exti_pin[i]].exti) {
                titan_pin_settings[exti_pin[i]].exti();
            }
            else if(titan_pin_settings[exti_pin[i]].exti_param) {
                titan_pin_settings[exti_pin[i]].exti_param(titan_pin_settings[exti_pin[i]].param);
            }
        }
    }
}

void EXTI15_10_IRQHandler(void) {
    for(uint8_t i = 10; i < 16; i++) {
        if(LL_EXTI_IsActiveFlag_0_31(titan_pin_settings[exti_pin[i]].exti_line) != RESET)
        {
            LL_EXTI_ClearFlag_0_31(titan_pin_settings[exti_pin[i]].exti_line);

            if(titan_pin_settings[exti_pin[i]].exti) {
                titan_pin_settings[exti_pin[i]].exti();
            }
            else if(titan_pin_settings[exti_pin[i]].exti_param) {
                titan_pin_settings[exti_pin[i]].exti_param(titan_pin_settings[exti_pin[i]].param);
            }
        }
    }
}

void TIM1_CC_IRQHandler(void) {
    passert(0);
}

void TIM3_IRQHandler(void) {
    passert(0);
}

void ADC1_IRQHandler(void) {
    if(LL_ADC_IsActiveFlag_EOC(ADC1) != 0) {
        LL_ADC_ClearFlag_EOC(ADC1);

        adc1_result = LL_ADC_REG_ReadConversionData12(ADC1);
        kernel_scheduler_io_wait_finished(adc1_waiting_task);
        kernel_scheduler_trigger();
    }
}
